// Напишите программу, которая выводит массив из восьми элементов,
// заполненный нулями и единицами в случайном порядке.

int[] Gen1DArr(int len, int min, int max)
{
    Random rnd = new Random();
    int[] arr = new int[len];

    for (int i = 0; i < len; i++)
    {
        arr[i] = rnd.Next(min,max+1);
    }

    return arr;
}

void Print1DArr(int[] arr)
{
    Console.Write("[");

    for (int i = 0; i < arr.Length - 1; i++)
    {
        Console.Write($"{arr[i]}, ");
    }
Console.WriteLine($"{arr[arr.Length - 1]}]");
}

Print1DArr(Gen1DArr(25,5,10));